--- src/lifecycle/effects/executor.rs
+++ replace command_output_to_result -> CommandResult with Default::default()
@@ -94,21 +94,17 @@
     match timeout(timeout_duration, child.wait_with_output()).await {
         Ok(Ok(output)) => Ok(output),
         Ok(Err(e)) => Err(CommandFailure::Io(e)),
         Err(_) => Err(CommandFailure::Timeout(timeout_duration)),
     }
 }
 
 fn command_output_to_result(output: std::process::Output) -> CommandResult {
-    CommandResult {
-        status_code: output.status.code(),
-        stdout: String::from_utf8_lossy(&output.stdout).to_string(),
-        stderr: String::from_utf8_lossy(&output.stderr).to_string(),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 impl CommandExecutor for TokioCommandExecutor {
     fn execute(
         &self,
         effect: Effect,
         cwd: Option<String>,
         timeout_secs: u64,
