--- src/main.rs
+++ delete match arm (Some(url), Some(password)) in build_server_config
@@ -55,21 +55,17 @@
             args.data_dir.to_string_lossy().into_owned(),
         ),
         opencode_server: build_server_config(args)?,
     })
 }
 
 fn build_server_config(args: &Args) -> anyhow::Result<Option<OpencodeServerConfig>> {
     let opencode_server = match (&args.server, &args.server_password) {
-        (Some(url), Some(password)) => Some(OpencodeServerConfig {
-            url: OpencodeUrl(url.clone()),
-            username: Username(args.server_user.clone()),
-            password: SensitiveString(password.clone()),
-        }),
+         /* ~ changed by cargo-mutants ~ */
         (Some(_), None) => {
             anyhow::bail!(
                 "--server-password (or OPENCODE_SERVER_PASSWORD) required when using --server"
             )
         }
         _ => None,
     };
     Ok(opencode_server)
