--- src/lifecycle/effects/executor.rs
+++ replace CommandResult::is_success -> bool with true
@@ -15,17 +15,17 @@
     pub status_code: Option<i32>,
     pub stdout: String,
     pub stderr: String,
 }
 
 impl CommandResult {
     #[must_use]
     pub fn is_success(&self) -> bool {
-        self.status_code == Some(0)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Error)]
 pub enum CommandFailure {
     #[error("timeout after {0:?}")]
     Timeout(Duration),
     #[error("io error: {0}")]
