--- src/lifecycle/effects/executor.rs
+++ replace TokioCommandExecutor::execute_impl -> std::result::Result<CommandResult, CommandFailure> with Ok(Default::default())
@@ -56,22 +56,17 @@
         Self
     }
 
     async fn execute_impl(
         effect: Effect,
         cwd: Option<String>,
         timeout_secs: u64,
     ) -> std::result::Result<CommandResult, CommandFailure> {
-        let program = effect.program();
-        let args = effect.args();
-        let timeout_duration = Duration::from_secs(timeout_secs);
-
-        let output = run_command(program, &args, cwd.as_deref(), timeout_duration).await?;
-        Ok(command_output_to_result(output))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 async fn run_command(
     program: &str,
     args: &[String],
     cwd: Option<&str>,
     timeout_duration: Duration,
