--- src/lifecycle/effects/executor.rs
+++ replace run_command -> std::result::Result<std::process::Output, CommandFailure> with Ok(Default::default())
@@ -71,24 +71,17 @@
 }
 
 async fn run_command(
     program: &str,
     args: &[String],
     cwd: Option<&str>,
     timeout_duration: Duration,
 ) -> std::result::Result<std::process::Output, CommandFailure> {
-    let mut cmd = Command::new(program);
-    cmd.args(args);
-    if let Some(dir) = cwd {
-        cmd.current_dir(dir);
-    }
-    cmd.stdout(Stdio::piped());
-    cmd.stderr(Stdio::piped());
-    wait_for_output(cmd, timeout_duration).await
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn wait_for_output(
     mut cmd: Command,
     timeout_duration: Duration,
 ) -> std::result::Result<std::process::Output, CommandFailure> {
     let child = cmd.spawn()?;
     match timeout(timeout_duration, child.wait_with_output()).await {
