--- src/lifecycle/effects/executor.rs
+++ replace wait_for_output -> std::result::Result<std::process::Output, CommandFailure> with Ok(Default::default())
@@ -85,22 +85,17 @@
     cmd.stderr(Stdio::piped());
     wait_for_output(cmd, timeout_duration).await
 }
 
 async fn wait_for_output(
     mut cmd: Command,
     timeout_duration: Duration,
 ) -> std::result::Result<std::process::Output, CommandFailure> {
-    let child = cmd.spawn()?;
-    match timeout(timeout_duration, child.wait_with_output()).await {
-        Ok(Ok(output)) => Ok(output),
-        Ok(Err(e)) => Err(CommandFailure::Io(e)),
-        Err(_) => Err(CommandFailure::Timeout(timeout_duration)),
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn command_output_to_result(output: std::process::Output) -> CommandResult {
     CommandResult {
         status_code: output.status.code(),
         stdout: String::from_utf8_lossy(&output.stdout).to_string(),
         stderr: String::from_utf8_lossy(&output.stderr).to_string(),
     }
