--- src/lifecycle/effects/run.rs
+++ replace classify_command_failure -> LifecycleError with Default::default()
@@ -13,25 +13,17 @@
         Effect::Jj { .. } => 120,
         Effect::MoonRun { .. } => 300,
         Effect::MoonCi { .. } => 600,
         Effect::Opencode { .. } => 3600,
     }
 }
 
 pub fn classify_command_failure(failure: &CommandFailure) -> LifecycleError {
-    match failure {
-        CommandFailure::Timeout(_) => {
-            LifecycleError::transient(FailureCategory::Command, "command timed out")
-        }
-        CommandFailure::Io(_) => LifecycleError::transient(
-            FailureCategory::Command,
-            "io error during command execution",
-        ),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn command_result_is_success(effect: &Effect, result: &CommandResult) -> bool {
     result.is_success()
         && match effect {
             Effect::Opencode { .. } => !opencode_output_is_error(&result.stdout, &result.stderr),
             _ => true,
         }
