--- src/lifecycle/effects/run.rs
+++ replace && with || in command_result_is_success
@@ -26,17 +26,17 @@
             FailureCategory::Command,
             "io error during command execution",
         ),
     }
 }
 
 fn command_result_is_success(effect: &Effect, result: &CommandResult) -> bool {
     result.is_success()
-        && match effect {
+        || /* ~ changed by cargo-mutants ~ */ match effect {
             Effect::Opencode { .. } => !opencode_output_is_error(&result.stdout, &result.stderr),
             _ => true,
         }
 }
 
 pub fn opencode_output_is_error(stdout: &str, stderr: &str) -> bool {
     stdout.contains("\"type\":\"error\"")
         || stderr.contains("ProviderModelNotFoundError")
