--- src/lifecycle/effects/run.rs
+++ delete match arm Effect::Opencode{..} in command_result_is_success
@@ -27,17 +27,17 @@
             "io error during command execution",
         ),
     }
 }
 
 fn command_result_is_success(effect: &Effect, result: &CommandResult) -> bool {
     result.is_success()
         && match effect {
-            Effect::Opencode { .. } => !opencode_output_is_error(&result.stdout, &result.stderr),
+             /* ~ changed by cargo-mutants ~ */
             _ => true,
         }
 }
 
 pub fn opencode_output_is_error(stdout: &str, stderr: &str) -> bool {
     stdout.contains("\"type\":\"error\"")
         || stderr.contains("ProviderModelNotFoundError")
         || stderr.contains("Model not found")
