--- src/lifecycle/effects/run.rs
+++ replace || with && in opencode_output_is_error
@@ -34,17 +34,17 @@
         && match effect {
             Effect::Opencode { .. } => !opencode_output_is_error(&result.stdout, &result.stderr),
             _ => true,
         }
 }
 
 pub fn opencode_output_is_error(stdout: &str, stderr: &str) -> bool {
     stdout.contains("\"type\":\"error\"")
-        || stderr.contains("ProviderModelNotFoundError")
+        && /* ~ changed by cargo-mutants ~ */ stderr.contains("ProviderModelNotFoundError")
         || stderr.contains("Model not found")
 }
 
 pub async fn run_effect<E: CommandExecutor>(
     executor: &E,
     effect: Effect,
     cwd: Option<String>,
 ) -> std::result::Result<EffectJournalEntry, LifecycleError> {
