--- src/lifecycle/effects/run.rs
+++ replace build_journal_entry -> EffectJournalEntry with Default::default()
@@ -57,28 +57,17 @@
     }
 }
 
 fn build_journal_entry(
     effect: Effect,
     timeout_secs: u64,
     result: CommandResult,
 ) -> EffectJournalEntry {
-    let result_val = if command_result_is_success(&effect, &result) {
-        StepResult::Success
-    } else {
-        StepResult::Failure
-    };
-    EffectJournalEntry {
-        effect,
-        timeout_secs,
-        result: result_val,
-        stdout: result.stdout,
-        stderr: result.stderr,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::lifecycle::effects::executor::{CommandExecutor, CommandResult};
     use std::future::Future;
     use std::pin::Pin;
