--- src/lifecycle/error.rs
+++ replace LifecycleError::terminal -> Self with Default::default()
@@ -31,20 +31,17 @@
         category: FailureCategory,
         message: String,
     },
 }
 
 impl LifecycleError {
     #[must_use]
     pub fn terminal(category: FailureCategory, message: impl Into<String>) -> Self {
-        Self::Terminal {
-            category,
-            message: message.into(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub fn transient(category: FailureCategory, message: impl Into<String>) -> Self {
         Self::Transient {
             category,
             message: message.into(),
         }
