--- src/lifecycle/error.rs
+++ replace LifecycleError::transient -> Self with Default::default()
@@ -39,20 +39,17 @@
         Self::Terminal {
             category,
             message: message.into(),
         }
     }
 
     #[must_use]
     pub fn transient(category: FailureCategory, message: impl Into<String>) -> Self {
-        Self::Transient {
-            category,
-            message: message.into(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     #[must_use]
     pub fn class(&self) -> FailureClass {
         match self {
             Self::Terminal { .. } => FailureClass::Terminal,
             Self::Transient { .. } => FailureClass::Transient,
