--- src/lifecycle/error.rs
+++ replace LifecycleError::class -> FailureClass with Default::default()
@@ -48,20 +48,17 @@
             category,
             message: message.into(),
         }
     }
 
     #[allow(dead_code)]
     #[must_use]
     pub fn class(&self) -> FailureClass {
-        match self {
-            Self::Terminal { .. } => FailureClass::Terminal,
-            Self::Transient { .. } => FailureClass::Transient,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     #[must_use]
     pub fn is_terminal(&self) -> bool {
         matches!(self, Self::Terminal { .. })
     }
 
