--- src/lifecycle/error.rs
+++ replace LifecycleError::is_terminal -> bool with true
@@ -57,17 +57,17 @@
             Self::Terminal { .. } => FailureClass::Terminal,
             Self::Transient { .. } => FailureClass::Transient,
         }
     }
 
     #[allow(dead_code)]
     #[must_use]
     pub fn is_terminal(&self) -> bool {
-        matches!(self, Self::Terminal { .. })
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     #[must_use]
     pub fn category(&self) -> FailureCategory {
         match self {
             Self::Terminal { category, .. } | Self::Transient { category, .. } => *category,
         }
