--- src/lifecycle/error.rs
+++ replace LifecycleError::message -> &str with ""
@@ -71,19 +71,17 @@
         match self {
             Self::Terminal { category, .. } | Self::Transient { category, .. } => *category,
         }
     }
 
     #[allow(dead_code)]
     #[must_use]
     pub fn message(&self) -> &str {
-        match self {
-            Self::Terminal { message, .. } | Self::Transient { message, .. } => message,
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::fmt::Display for LifecycleError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         match self {
             Self::Terminal { category, message } => {
                 write!(f, "terminal {category:?}: {message}")
