--- src/lifecycle/error.rs
+++ replace <impl std::fmt::Display for LifecycleError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -79,24 +79,17 @@
         match self {
             Self::Terminal { message, .. } | Self::Transient { message, .. } => message,
         }
     }
 }
 
 impl std::fmt::Display for LifecycleError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::Terminal { category, message } => {
-                write!(f, "terminal {category:?}: {message}")
-            }
-            Self::Transient { category, message } => {
-                write!(f, "transient {category:?}: {message}")
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for LifecycleError {}
 
 #[cfg(test)]
 mod tests {
     use super::*;
