--- src/lifecycle/run/lifecycle.rs
+++ replace send_initialized with ()
@@ -164,24 +164,17 @@
     finish_lifecycle(&db, bead_id, run, &tx).await
 }
 
 async fn send_initialized(
     tx: &mpsc::Sender<LifecycleProgress>,
     bead_id: &BeadId,
     steps: &[LifecycleStep],
 ) {
-    send_progress(
-        tx,
-        LifecycleProgress::Initialized {
-            bead_id: bead_id.clone(),
-            steps: steps.iter().map(|s| s.name.clone()).collect(),
-        },
-    )
-    .await;
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 async fn finish_lifecycle(
     db: &StateDb,
     bead_id: BeadId,
     run: StepRun,
     tx: &mpsc::Sender<LifecycleProgress>,
 ) -> std::result::Result<(), LifecycleError> {
