--- src/lifecycle/run/lifecycle.rs
+++ replace finish_lifecycle -> std::result::Result<(), LifecycleError> with Ok(())
@@ -180,21 +180,17 @@
 }
 
 async fn finish_lifecycle(
     db: &StateDb,
     bead_id: BeadId,
     run: StepRun,
     tx: &mpsc::Sender<LifecycleProgress>,
 ) -> std::result::Result<(), LifecycleError> {
-    send_finished_success(tx).await;
-    let completed_state = transition_completed(run.workflow_state)?;
-    persist_completed_state(db, &completed_state, &run.journal)?;
-    info!("lifecycle completed for {:?}", bead_id);
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn send_finished_success(tx: &mpsc::Sender<LifecycleProgress>) {
     send_progress(
         tx,
         LifecycleProgress::Finished {
             result: StepResult::Success,
             message: Some(ErrorMessage::from("all steps completed")),
