--- src/lifecycle/run/lifecycle.rs
+++ replace persist_completed_state -> std::result::Result<(), LifecycleError> with Ok(())
@@ -216,22 +216,17 @@
         })
 }
 
 fn persist_completed_state(
     db: &StateDb,
     state: &WorkflowState,
     journal: &[EffectJournalEntry],
 ) -> std::result::Result<(), LifecycleError> {
-    persist_state(db, state, journal).map_err(|e| {
-        LifecycleError::terminal(
-            crate::lifecycle::error::FailureCategory::Workspace,
-            e.to_string(),
-        )
-    })
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ─── TESTS ───────────────────────────────────────────────────────────────────
 
 #[allow(clippy::unwrap_used, clippy::expect_used, clippy::panic)]
 #[cfg(test)]
 mod tests {
     use super::*;
