--- src/lifecycle/run/lifecycle.rs
+++ replace LifecycleOrchestrator::run_lifecycle -> std::result::Result<mpsc::Receiver<LifecycleProgress>, LifecycleError> with Ok(Receiver::from(Default::default()))
@@ -51,26 +51,17 @@
             server_config: config.opencode_server,
         })
     }
 
     pub async fn run_lifecycle(
         &self,
         request: LifecycleRequest,
     ) -> std::result::Result<mpsc::Receiver<LifecycleProgress>, LifecycleError> {
-        let (tx, rx) = mpsc::channel(100);
-        let db = self.db.clone();
-        let executor = self.executor;
-        let server_config = self.server_config.clone();
-        tokio::spawn(async move {
-            if let Err(e) = run_lifecycle_inner(db, executor, server_config, request, tx).await {
-                error!("lifecycle error: {e}");
-            }
-        });
-        Ok(rx)
+        Ok(Receiver::from(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     pub fn get_workflow_state(
         &self,
         bead_id: &BeadId,
     ) -> std::result::Result<Option<WorkflowState>, LifecycleError> {
         load_state(&self.db, bead_id)
