--- src/lifecycle/run/lifecycle.rs
+++ replace LifecycleOrchestrator::get_workflow_state -> std::result::Result<Option<WorkflowState>, LifecycleError> with Ok(Some(Default::default()))
@@ -68,24 +68,17 @@
         Ok(rx)
     }
 
     #[allow(dead_code)]
     pub fn get_workflow_state(
         &self,
         bead_id: &BeadId,
     ) -> std::result::Result<Option<WorkflowState>, LifecycleError> {
-        load_state(&self.db, bead_id)
-            .map(|opt| opt.map(|(s, _)| s))
-            .map_err(|e| {
-                LifecycleError::terminal(
-                    crate::lifecycle::error::FailureCategory::Workspace,
-                    e.to_string(),
-                )
-            })
+        Ok(Some(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(super) async fn send_progress(
     tx: &mpsc::Sender<LifecycleProgress>,
     progress: LifecycleProgress,
 ) {
     if tx.send(progress).await.is_err() {
