--- src/lifecycle/run/lifecycle.rs
+++ replace send_progress with ()
@@ -83,19 +83,17 @@
             })
     }
 }
 
 pub(super) async fn send_progress(
     tx: &mpsc::Sender<LifecycleProgress>,
     progress: LifecycleProgress,
 ) {
-    if tx.send(progress).await.is_err() {
-        warn!("progress channel closed, receiver dropped");
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn build_steps(request: &LifecycleRequest) -> Vec<LifecycleStep> {
     let workspace_step = LifecycleStep {
         name: StepName("workspace-prepare".to_owned()),
         effect: Effect::WorkspacePrepare {
             workspace: WorkspaceName(format!("workspace-{}", request.bead_id.as_str())),
             path: WorkspacePath(format!("../{}", request.bead_id.as_str())),
