--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ replace parse_opencode_effect -> std::result::Result<(&PromptString, &ModelId, Option<&WorkspacePath>), LifecycleError> with Ok((Box::leak(Box::new(Default::default())), Box::leak(Box::new(Default::default())), Some(Box::leak(Box::new(Default::default())))))
@@ -104,23 +104,17 @@
         model_id,
         cwd: cwd.map(|p| p.as_str()),
     }
 }
 
 fn parse_opencode_effect(
     effect: &Effect,
 ) -> std::result::Result<(&PromptString, &ModelId, Option<&WorkspacePath>), LifecycleError> {
-    match effect {
-        Effect::Opencode { prompt, model, cwd } => Ok((prompt, model, cwd.as_ref())),
-        _ => Err(LifecycleError::terminal(
-            crate::lifecycle::error::FailureCategory::Validation,
-            "invalid effect for send message",
-        )),
-    }
+    Ok((Box::leak(Box::new(Default::default())), Box::leak(Box::new(Default::default())), Some(Box::leak(Box::new(Default::default()))))) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn send_opencode_request(
     client: &reqwest::Client,
     url: &str,
     username: &Username,
     password: &SensitiveString,
     body: &OpencodeMessageBody<'_>,
