--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ delete match arm Effect::Opencode{prompt, model, cwd} in parse_opencode_effect
@@ -105,17 +105,17 @@
         cwd: cwd.map(|p| p.as_str()),
     }
 }
 
 fn parse_opencode_effect(
     effect: &Effect,
 ) -> std::result::Result<(&PromptString, &ModelId, Option<&WorkspacePath>), LifecycleError> {
     match effect {
-        Effect::Opencode { prompt, model, cwd } => Ok((prompt, model, cwd.as_ref())),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(LifecycleError::terminal(
             crate::lifecycle::error::FailureCategory::Validation,
             "invalid effect for send message",
         )),
     }
 }
 
 async fn send_opencode_request(
