--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ replace send_opencode_request -> std::result::Result<reqwest::Response, LifecycleError> with Ok(Default::default())
@@ -120,28 +120,17 @@
 
 async fn send_opencode_request(
     client: &reqwest::Client,
     url: &str,
     username: &Username,
     password: &SensitiveString,
     body: &OpencodeMessageBody<'_>,
 ) -> std::result::Result<reqwest::Response, LifecycleError> {
-    client
-        .post(url)
-        .basic_auth(username.as_str(), Some(password.as_str()))
-        .json(body)
-        .send()
-        .await
-        .map_err(|e| {
-            LifecycleError::transient(
-                crate::lifecycle::error::FailureCategory::Command,
-                format!("opencode server message send failed: {e}"),
-            )
-        })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_message_response(status: reqwest::StatusCode, body: String) -> (StepResult, String) {
     let result = if status.is_success() && !opencode_output_is_error(&body, "") {
         StepResult::Success
     } else {
         StepResult::Failure
     };
