--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ delete ! in parse_message_response
@@ -135,17 +135,17 @@
             LifecycleError::transient(
                 crate::lifecycle::error::FailureCategory::Command,
                 format!("opencode server message send failed: {e}"),
             )
         })
 }
 
 fn parse_message_response(status: reqwest::StatusCode, body: String) -> (StepResult, String) {
-    let result = if status.is_success() && !opencode_output_is_error(&body, "") {
+    let result = if status.is_success() &&  /* ~ changed by cargo-mutants ~ */opencode_output_is_error(&body, "") {
         StepResult::Success
     } else {
         StepResult::Failure
     };
     (result, body.chars().take(4096).collect())
 }
 
 async fn server_send_message(
