--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ replace parse_message_response -> (StepResult, String) with (Default::default(), "xyzzy".into())
@@ -135,22 +135,17 @@
             LifecycleError::transient(
                 crate::lifecycle::error::FailureCategory::Command,
                 format!("opencode server message send failed: {e}"),
             )
         })
 }
 
 fn parse_message_response(status: reqwest::StatusCode, body: String) -> (StepResult, String) {
-    let result = if status.is_success() && !opencode_output_is_error(&body, "") {
-        StepResult::Success
-    } else {
-        StepResult::Failure
-    };
-    (result, body.chars().take(4096).collect())
+    (Default::default(), "xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn server_send_message(
     config: &OpencodeServerConfig,
     session_id: &str,
     effect: &Effect,
     client: &reqwest::Client,
 ) -> std::result::Result<(StepResult, String), LifecycleError> {
