--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ replace build_message_url -> String with "xyzzy".into()
@@ -157,21 +157,17 @@
     let (prompt, model, cwd) = parse_opencode_effect(effect)?;
     let message_body = build_message_body(prompt, model, cwd);
     let msg_url = build_message_url(config, session_id);
     let msg_resp = send_message(config, client, &msg_url, &message_body).await?;
     read_message_response(msg_resp).await
 }
 
 fn build_message_url(config: &OpencodeServerConfig, session_id: &str) -> String {
-    format!(
-        "{}/session/{}/message",
-        config.url.as_str().trim_end_matches('/'),
-        session_id
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 async fn send_message(
     config: &OpencodeServerConfig,
     client: &reqwest::Client,
     msg_url: &str,
     message_body: &OpencodeMessageBody<'_>,
 ) -> std::result::Result<reqwest::Response, LifecycleError> {
