--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ replace read_message_response -> std::result::Result<(StepResult, String), LifecycleError> with Ok((Default::default(), "xyzzy".into()))
@@ -183,24 +183,17 @@
         message_body,
     )
     .await
 }
 
 async fn read_message_response(
     msg_resp: reqwest::Response,
 ) -> std::result::Result<(StepResult, String), LifecycleError> {
-    let msg_status = msg_resp.status();
-    let msg_body = msg_resp.text().await.map_err(|e| {
-        LifecycleError::transient(
-            crate::lifecycle::error::FailureCategory::Command,
-            format!("opencode server response read failed: {e}"),
-        )
-    })?;
-    Ok(parse_message_response(msg_status, msg_body))
+    Ok((Default::default(), "xyzzy".into())) /* ~ changed by cargo-mutants ~ */
 }
 
 fn create_opencode_journal_entry(
     prompt: &PromptString,
     model: &ModelId,
     cwd: &Option<WorkspacePath>,
     result: StepResult,
     msg_body: String,
