--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ replace create_opencode_journal_entry -> EffectJournalEntry with Default::default()
@@ -200,27 +200,17 @@
 
 fn create_opencode_journal_entry(
     prompt: &PromptString,
     model: &ModelId,
     cwd: &Option<WorkspacePath>,
     result: StepResult,
     msg_body: String,
 ) -> EffectJournalEntry {
-    EffectJournalEntry {
-        effect: Effect::Opencode {
-            prompt: prompt.clone(),
-            model: model.clone(),
-            cwd: cwd.clone(),
-        },
-        timeout_secs: OPENCODE_TIMEOUT_SECS,
-        result,
-        stdout: journal_stdout(&result, &msg_body),
-        stderr: journal_stderr(&result, msg_body),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn journal_stdout(result: &StepResult, msg_body: &str) -> String {
     if result.is_success() {
         msg_body.to_owned()
     } else {
         String::new()
     }
