--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ replace journal_stderr -> String with String::new()
@@ -222,21 +222,17 @@
     if result.is_success() {
         msg_body.to_owned()
     } else {
         String::new()
     }
 }
 
 fn journal_stderr(result: &StepResult, msg_body: String) -> String {
-    if result.is_success() {
-        String::new()
-    } else {
-        msg_body
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub(super) async fn run_opencode_server(
     config: &OpencodeServerConfig,
     effect: &Effect,
 ) -> std::result::Result<EffectJournalEntry, LifecycleError> {
     let Effect::Opencode { prompt, model, cwd } = effect else {
         return Err(LifecycleError::terminal(
