--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ replace run_opencode_server -> std::result::Result<EffectJournalEntry, LifecycleError> with Ok(Default::default())
@@ -233,28 +233,17 @@
         msg_body
     }
 }
 
 pub(super) async fn run_opencode_server(
     config: &OpencodeServerConfig,
     effect: &Effect,
 ) -> std::result::Result<EffectJournalEntry, LifecycleError> {
-    let Effect::Opencode { prompt, model, cwd } = effect else {
-        return Err(LifecycleError::terminal(
-            crate::lifecycle::error::FailureCategory::Validation,
-            "invalid effect",
-        ));
-    };
-    let client = reqwest::Client::new();
-    let session_id = server_create_session(config, prompt, &client).await?;
-    let (result, msg_body) = server_send_message(config, &session_id, effect, &client).await?;
-    Ok(create_opencode_journal_entry(
-        prompt, model, cwd, result, msg_body,
-    ))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ─── TESTS ───────────────────────────────────────────────────────────────────
 
 #[allow(clippy::unwrap_used, clippy::expect_used, clippy::panic)]
 #[cfg(test)]
 mod tests {
     use super::*;
