--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ replace parse_session_response -> std::result::Result<String, LifecycleError> with Ok(String::new())
@@ -41,24 +41,17 @@
     serde_json::json!({
         "title": format!("oya-lite: {}", prompt.as_str().len().min(40))
     })
 }
 
 async fn parse_session_response(
     session_resp: reqwest::Response,
 ) -> std::result::Result<String, LifecycleError> {
-    if !session_resp.status().is_success() {
-        let error_msg = read_error_body(session_resp).await;
-        return Err(LifecycleError::terminal(
-            crate::lifecycle::error::FailureCategory::Command,
-            error_msg,
-        ));
-    }
-    extract_session_id(session_resp).await
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn read_error_body(resp: reqwest::Response) -> String {
     let status = resp.status();
     let body = match resp.text().await {
         Ok(text) => text,
         Err(e) => format!("unable to read response body: {e}"),
     };
