--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ delete ! in parse_session_response
@@ -41,17 +41,17 @@
     serde_json::json!({
         "title": format!("oya-lite: {}", prompt.as_str().len().min(40))
     })
 }
 
 async fn parse_session_response(
     session_resp: reqwest::Response,
 ) -> std::result::Result<String, LifecycleError> {
-    if !session_resp.status().is_success() {
+    if  /* ~ changed by cargo-mutants ~ */session_resp.status().is_success() {
         let error_msg = read_error_body(session_resp).await;
         return Err(LifecycleError::terminal(
             crate::lifecycle::error::FailureCategory::Command,
             error_msg,
         ));
     }
     extract_session_id(session_resp).await
 }
