--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ replace read_error_body -> String with "xyzzy".into()
@@ -52,23 +52,17 @@
             crate::lifecycle::error::FailureCategory::Command,
             error_msg,
         ));
     }
     extract_session_id(session_resp).await
 }
 
 async fn read_error_body(resp: reqwest::Response) -> String {
-    let status = resp.status();
-    let body = match resp.text().await {
-        Ok(text) => text,
-        Err(e) => format!("unable to read response body: {e}"),
-    };
-    let body = body.chars().take(200).collect::<String>();
-    format!("opencode server returned {status}: {body}")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 async fn extract_session_id(
     session_resp: reqwest::Response,
 ) -> std::result::Result<String, LifecycleError> {
     let session_data: serde_json::Value = session_resp.json().await.map_err(|e| {
         LifecycleError::terminal(
             crate::lifecycle::error::FailureCategory::Command,
