--- src/lifecycle/run/lifecycle/opencode_server.rs
+++ replace build_message_body -> OpencodeMessageBody<'a> with Default::default()
@@ -87,28 +87,17 @@
         })
 }
 
 fn build_message_body<'a>(
     prompt: &'a PromptString,
     model: &'a ModelId,
     cwd: Option<&'a WorkspacePath>,
 ) -> OpencodeMessageBody<'a> {
-    let parts = model.as_str().split('/').collect::<Vec<_>>();
-    let (provider_id, model_id) = match parts.as_slice() {
-        [provider, model, ..] => (*provider, *model),
-        [single] => ("anthropic", *single),
-        [] => ("anthropic", "unknown"),
-    };
-    OpencodeMessageBody {
-        parts: vec![serde_json::json!({"type": "text", "text": prompt.as_str()})],
-        provider_id,
-        model_id,
-        cwd: cwd.map(|p| p.as_str()),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_opencode_effect(
     effect: &Effect,
 ) -> std::result::Result<(&PromptString, &ModelId, Option<&WorkspacePath>), LifecycleError> {
     match effect {
         Effect::Opencode { prompt, model, cwd } => Ok((prompt, model, cwd.as_ref())),
         _ => Err(LifecycleError::terminal(
