--- src/lifecycle/run/lifecycle/steps.rs
+++ replace finish_step -> std::result::Result<StepRun, StepFailure> with Ok(Default::default())
@@ -124,22 +124,17 @@
 }
 
 async fn finish_step(
     run: StepRun,
     entry: EffectJournalEntry,
     step_name: &StepName,
     tx: &mpsc::Sender<LifecycleProgress>,
 ) -> std::result::Result<StepRun, StepFailure> {
-    let transitioned_run = handle_step_transition(run, step_name, &entry).await?;
-    if entry.result.is_success() {
-        Ok(on_step_success(transitioned_run, entry, step_name, tx).await)
-    } else {
-        Err(on_step_failure(transitioned_run, entry, step_name, tx).await)
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn to_step_failure(run: &StepRun, error: LifecycleError) -> StepFailure {
     StepFailure {
         partial_run: StepRun {
             workflow_state: run.workflow_state.clone(),
             journal: run.journal.clone(),
         },
