--- src/lifecycle/run/lifecycle/steps.rs
+++ replace on_dispatch_failure -> StepFailure with Default::default()
@@ -148,29 +148,17 @@
 }
 
 async fn on_dispatch_failure(
     run: StepRun,
     step_name: &StepName,
     tx: &mpsc::Sender<LifecycleProgress>,
     error: LifecycleError,
 ) -> StepFailure {
-    let message = ErrorMessage(error.to_string());
-    send_progress(
-        tx,
-        LifecycleProgress::StepFailed {
-            step: step_name.clone(),
-            error: message,
-        },
-    )
-    .await;
-    StepFailure {
-        partial_run: run,
-        error,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 async fn dispatch_effect(
     executor: TokioCommandExecutor,
     effect: &crate::lifecycle::types::Effect,
     server_config: Option<&OpencodeServerConfig>,
 ) -> std::result::Result<EffectJournalEntry, LifecycleError> {
     let cwd = effect.cwd().map(|p| p.0.clone());
