--- src/lifecycle/run/lifecycle/steps.rs
+++ replace dispatch_effect -> std::result::Result<EffectJournalEntry, LifecycleError> with Ok(Default::default())
@@ -168,23 +168,17 @@
     }
 }
 
 async fn dispatch_effect(
     executor: TokioCommandExecutor,
     effect: &crate::lifecycle::types::Effect,
     server_config: Option<&OpencodeServerConfig>,
 ) -> std::result::Result<EffectJournalEntry, LifecycleError> {
-    let cwd = effect.cwd().map(|p| p.0.clone());
-    match (effect, server_config) {
-        (crate::lifecycle::types::Effect::Opencode { .. }, Some(cfg)) => {
-            run_opencode_server(cfg, effect).await
-        }
-        _ => run_effect(&executor, effect.clone(), cwd).await,
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn append_to_journal(
     journal: Vec<EffectJournalEntry>,
     entry: EffectJournalEntry,
 ) -> Vec<EffectJournalEntry> {
     journal.into_iter().chain(std::iter::once(entry)).collect()
 }
