--- src/lifecycle/run/lifecycle/steps.rs
+++ replace send_step_failed with ()
@@ -222,24 +222,17 @@
     build_step_failure(run.workflow_state, journal, failure_message)
 }
 
 async fn send_step_failed(
     tx: &mpsc::Sender<LifecycleProgress>,
     step_name: &StepName,
     message: &str,
 ) {
-    send_progress(
-        tx,
-        LifecycleProgress::StepFailed {
-            step: step_name.clone(),
-            error: ErrorMessage(message.to_owned()),
-        },
-    )
-    .await;
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn build_step_failure(
     workflow_state: WorkflowState,
     journal: Vec<EffectJournalEntry>,
     failure_message: String,
 ) -> StepFailure {
     StepFailure {
