--- src/lifecycle/run/lifecycle/steps.rs
+++ replace build_step_failure -> StepFailure with Default::default()
@@ -237,26 +237,17 @@
     .await;
 }
 
 fn build_step_failure(
     workflow_state: WorkflowState,
     journal: Vec<EffectJournalEntry>,
     failure_message: String,
 ) -> StepFailure {
-    StepFailure {
-        partial_run: StepRun {
-            workflow_state,
-            journal,
-        },
-        error: LifecycleError::terminal(
-            crate::lifecycle::error::FailureCategory::Command,
-            failure_message,
-        ),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn sanitize_failure_message(entry: &EffectJournalEntry) -> String {
     if opencode_output_is_error(&entry.stdout, &entry.stderr) {
         return "opencode model not found or unavailable".to_owned();
     }
     match first_nonempty_line(&entry.stderr).or_else(|| first_nonempty_line(&entry.stdout)) {
         Some(line) => line.to_owned(),
