--- src/lifecycle/run/lifecycle/steps.rs
+++ replace handle_step_transition -> Result<StepRun, StepFailure> with Ok(Default::default())
@@ -36,34 +36,17 @@
     Ok(run)
 }
 
 async fn handle_step_transition(
     run: StepRun,
     step_name: &StepName,
     entry: &EffectJournalEntry,
 ) -> Result<StepRun, StepFailure> {
-    if !entry.result.is_success() {
-        return Ok(run);
-    }
-    let Some(event) = workspace_ready_event(step_name) else {
-        return Ok(run);
-    };
-    let StepRun {
-        workflow_state,
-        journal,
-    } = run;
-    let prev_state = workflow_state.clone();
-    match workflow_state.with_transition(event) {
-        Ok(state) => Ok(StepRun {
-            workflow_state: state,
-            journal,
-        }),
-        Err(error) => Err(step_transition_failure(prev_state, journal, error)),
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn workspace_ready_event(step_name: &StepName) -> Option<StateEvent> {
     match step_name.as_str() {
         "workspace-prepare" => Some(StateEvent::WorkspaceReady),
         _ => None,
     }
 }
