--- src/lifecycle/run/lifecycle/steps.rs
+++ replace step_transition_failure -> StepFailure with Default::default()
@@ -68,23 +68,17 @@
     }
 }
 
 fn step_transition_failure(
     workflow_state: WorkflowState,
     journal: Vec<EffectJournalEntry>,
     error: LifecycleError,
 ) -> StepFailure {
-    StepFailure {
-        partial_run: StepRun {
-            workflow_state,
-            journal,
-        },
-        error,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 async fn execute_single_step(
     executor: TokioCommandExecutor,
     step: &LifecycleStep,
     mut run: StepRun,
     tx: &mpsc::Sender<LifecycleProgress>,
     server_config: Option<&OpencodeServerConfig>,
