--- src/lifecycle/state/state_db.rs
+++ replace StateDb::delete_workflow -> Result<()> with Ok(())
@@ -92,18 +92,17 @@
                     .ok()
                     .and_then(|k| String::from_utf8(k.to_vec()).ok())
             })
             .collect())
     }
 
     #[allow(dead_code)]
     pub fn delete_workflow(&self, bead_id: &BeadId) -> Result<()> {
-        self.workflows.remove(bead_id.as_str())?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn flush(&self) -> Result<()> {
         self.db.persist(PersistMode::SyncAll)?;
         Ok(())
     }
 
     #[allow(dead_code)]
