--- src/lifecycle/state/state_db.rs
+++ replace StateDb::snapshot -> fjall::Snapshot with Default::default()
@@ -103,17 +103,17 @@
 
     pub fn flush(&self) -> Result<()> {
         self.db.persist(PersistMode::SyncAll)?;
         Ok(())
     }
 
     #[allow(dead_code)]
     pub fn snapshot(&self) -> fjall::Snapshot {
-        self.db.snapshot()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn batch_persist_state(
         &self,
         bead_id: &BeadId,
         state_json: &str,
         journal_entries: &[(String, String)],
     ) -> Result<()> {
