--- src/lifecycle/state/state_db.rs
+++ replace StateDb::batch_persist_state -> Result<()> with Ok(())
@@ -112,23 +112,17 @@
     }
 
     pub fn batch_persist_state(
         &self,
         bead_id: &BeadId,
         state_json: &str,
         journal_entries: &[(String, String)],
     ) -> Result<()> {
-        let mut batch = self.db.batch();
-        batch.insert(&self.workflows, bead_id.as_str(), state_json);
-        for (key, value) in journal_entries {
-            batch.insert(&self.journal, key.as_str(), value.as_str());
-        }
-        batch.commit()?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn next_journal_key(&self, bead_id: &BeadId) -> String {
         next_journal_key(bead_id)
     }
 }
 
 static JOURNAL_COUNTER: AtomicU64 = AtomicU64::new(0);
