--- src/lifecycle/state/state_db.rs
+++ replace StateDb::next_journal_key -> String with "xyzzy".into()
@@ -122,17 +122,17 @@
         for (key, value) in journal_entries {
             batch.insert(&self.journal, key.as_str(), value.as_str());
         }
         batch.commit()?;
         Ok(())
     }
 
     pub fn next_journal_key(&self, bead_id: &BeadId) -> String {
-        next_journal_key(bead_id)
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 static JOURNAL_COUNTER: AtomicU64 = AtomicU64::new(0);
 
 fn timestamp_now() -> u64 {
     match std::time::SystemTime::now().duration_since(std::time::UNIX_EPOCH) {
         Ok(d) => d.as_millis() as u64,
