--- src/lifecycle/state/state_db.rs
+++ replace next_journal_key -> String with "xyzzy".into()
@@ -136,19 +136,17 @@
 fn timestamp_now() -> u64 {
     match std::time::SystemTime::now().duration_since(std::time::UNIX_EPOCH) {
         Ok(d) => d.as_millis() as u64,
         Err(_) => 0,
     }
 }
 
 fn next_journal_key(bead_id: &BeadId) -> String {
-    let ts = timestamp_now();
-    let seq = JOURNAL_COUNTER.fetch_add(1, Ordering::SeqCst);
-    format!("{}_{ts:020}_{seq:010}", bead_id.as_str())
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 // ─── TESTS ───────────────────────────────────────────────────────────────────
 
 #[allow(clippy::unwrap_used, clippy::expect_used, clippy::panic)]
 #[cfg(test)]
 mod tests {
     use super::*;
