--- src/lifecycle/state/state_db.rs
+++ replace StateDb::open -> Result<Self> with Ok(Default::default())
@@ -27,27 +27,17 @@
 pub struct StateDb {
     db: Arc<Database>,
     workflows: Keyspace,
     journal: Keyspace,
 }
 
 impl StateDb {
     pub fn open(path: impl AsRef<Path>) -> Result<Self> {
-        let db = Database::builder(path)
-            .cache_size(64 * 1024 * 1024)
-            .journal_compression(fjall::CompressionType::Lz4)
-            .open()?;
-        let workflows = db.keyspace(KEYSPACE_WORKFLOWS, KeyspaceCreateOptions::default)?;
-        let journal = db.keyspace(KEYSPACE_JOURNAL, KeyspaceCreateOptions::default)?;
-        Ok(Self {
-            db: Arc::new(db),
-            workflows,
-            journal,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     pub fn persist_workflow(&self, bead_id: &BeadId, state_json: &str) -> Result<()> {
         self.workflows.insert(bead_id.as_str(), state_json)?;
         Ok(())
     }
 
