--- src/lifecycle/state/state_db.rs
+++ replace * with / in StateDb::open
@@ -28,17 +28,17 @@
     db: Arc<Database>,
     workflows: Keyspace,
     journal: Keyspace,
 }
 
 impl StateDb {
     pub fn open(path: impl AsRef<Path>) -> Result<Self> {
         let db = Database::builder(path)
-            .cache_size(64 * 1024 * 1024)
+            .cache_size(64 * 1024 / /* ~ changed by cargo-mutants ~ */ 1024)
             .journal_compression(fjall::CompressionType::Lz4)
             .open()?;
         let workflows = db.keyspace(KEYSPACE_WORKFLOWS, KeyspaceCreateOptions::default)?;
         let journal = db.keyspace(KEYSPACE_JOURNAL, KeyspaceCreateOptions::default)?;
         Ok(Self {
             db: Arc::new(db),
             workflows,
             journal,
