--- src/lifecycle/state/state_db.rs
+++ replace StateDb::persist_workflow -> Result<()> with Ok(())
@@ -42,18 +42,17 @@
             db: Arc::new(db),
             workflows,
             journal,
         })
     }
 
     #[allow(dead_code)]
     pub fn persist_workflow(&self, bead_id: &BeadId, state_json: &str) -> Result<()> {
-        self.workflows.insert(bead_id.as_str(), state_json)?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     pub fn load_workflow(&self, bead_id: &BeadId) -> Result<Option<String>> {
         self.workflows
             .get(bead_id.as_str())
             .map_err(StateDbError::Fjall)
             .map(|opt| opt.and_then(|v| String::from_utf8(v.to_vec()).ok()))
