--- src/lifecycle/state/state_db.rs
+++ replace StateDb::append_journal -> Result<()> with Ok(())
@@ -56,19 +56,17 @@
         self.workflows
             .get(bead_id.as_str())
             .map_err(StateDbError::Fjall)
             .map(|opt| opt.and_then(|v| String::from_utf8(v.to_vec()).ok()))
     }
 
     #[allow(dead_code)]
     pub fn append_journal(&self, bead_id: &BeadId, entry_json: &str) -> Result<()> {
-        let key = next_journal_key(bead_id);
-        self.journal.insert(&key, entry_json)?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     pub fn load_journal(&self, bead_id: &BeadId) -> Result<Vec<String>> {
         let prefix = format!("{}_", bead_id.as_str());
         Ok(self
             .journal
             .prefix(&prefix)
