--- src/lifecycle/state/state_db.rs
+++ replace StateDb::load_journal -> Result<Vec<String>> with Ok(vec!["xyzzy".into()])
@@ -63,27 +63,17 @@
     pub fn append_journal(&self, bead_id: &BeadId, entry_json: &str) -> Result<()> {
         let key = next_journal_key(bead_id);
         self.journal.insert(&key, entry_json)?;
         Ok(())
     }
 
     #[allow(dead_code)]
     pub fn load_journal(&self, bead_id: &BeadId) -> Result<Vec<String>> {
-        let prefix = format!("{}_", bead_id.as_str());
-        Ok(self
-            .journal
-            .prefix(&prefix)
-            .filter_map(|guard| {
-                guard
-                    .value()
-                    .ok()
-                    .and_then(|bytes| String::from_utf8(bytes.to_vec()).ok())
-            })
-            .collect())
+        Ok(vec!["xyzzy".into()]) /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     pub fn list_workflow_ids(&self) -> Result<Vec<String>> {
         Ok(self
             .workflows
             .iter()
             .filter_map(|guard| {
