--- src/lifecycle/state/state_db.rs
+++ replace StateDb::list_workflow_ids -> Result<Vec<String>> with Ok(vec!["xyzzy".into()])
@@ -78,26 +78,17 @@
                     .ok()
                     .and_then(|bytes| String::from_utf8(bytes.to_vec()).ok())
             })
             .collect())
     }
 
     #[allow(dead_code)]
     pub fn list_workflow_ids(&self) -> Result<Vec<String>> {
-        Ok(self
-            .workflows
-            .iter()
-            .filter_map(|guard| {
-                guard
-                    .key()
-                    .ok()
-                    .and_then(|k| String::from_utf8(k.to_vec()).ok())
-            })
-            .collect())
+        Ok(vec!["xyzzy".into()]) /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     pub fn delete_workflow(&self, bead_id: &BeadId) -> Result<()> {
         self.workflows.remove(bead_id.as_str())?;
         Ok(())
     }
 
