--- src/lifecycle/types/effects.rs
+++ replace Effect::program -> &'static str with "xyzzy"
@@ -35,22 +35,17 @@
 pub struct OpencodeServerConfig {
     pub url: OpencodeUrl,
     pub username: Username,
     pub password: SensitiveString,
 }
 
 impl Effect {
     pub fn program(&self) -> &'static str {
-        match self {
-            Self::WorkspacePrepare { .. } => "mkdir",
-            Self::Jj { .. } => "jj",
-            Self::MoonRun { .. } | Self::MoonCi { .. } => "moon",
-            Self::Opencode { .. } => "opencode",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn cwd(&self) -> Option<&WorkspacePath> {
         match self {
             Self::WorkspacePrepare { .. } => None,
             Self::Jj { cwd, .. }
             | Self::MoonRun { cwd, .. }
             | Self::MoonCi { cwd, .. }
