--- src/lifecycle/types/effects.rs
+++ replace Effect::cwd -> Option<&WorkspacePath> with Some(Box::leak(Box::new(Default::default())))
@@ -44,23 +44,17 @@
             Self::WorkspacePrepare { .. } => "mkdir",
             Self::Jj { .. } => "jj",
             Self::MoonRun { .. } | Self::MoonCi { .. } => "moon",
             Self::Opencode { .. } => "opencode",
         }
     }
 
     pub fn cwd(&self) -> Option<&WorkspacePath> {
-        match self {
-            Self::WorkspacePrepare { .. } => None,
-            Self::Jj { cwd, .. }
-            | Self::MoonRun { cwd, .. }
-            | Self::MoonCi { cwd, .. }
-            | Self::Opencode { cwd, .. } => cwd.as_ref(),
-        }
+        Some(Box::leak(Box::new(Default::default()))) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn args(&self) -> Vec<String> {
         match self {
             Self::WorkspacePrepare { path, .. } => vec!["-p".to_owned(), path.0.clone()],
             Self::Jj { args, .. } => args.0.clone(),
             Self::MoonRun { task, .. } => vec!["run".to_owned(), task.0.clone()],
             Self::MoonCi { .. } => vec!["run".to_owned(), ":ci".to_owned()],
