--- src/lifecycle/types/effects.rs
+++ replace opencode_args -> Vec<String> with vec!["xyzzy".into()]
@@ -65,23 +65,16 @@
             Self::MoonRun { task, .. } => vec!["run".to_owned(), task.0.clone()],
             Self::MoonCi { .. } => vec!["run".to_owned(), ":ci".to_owned()],
             Self::Opencode { prompt, model, .. } => opencode_args(prompt, model),
         }
     }
 }
 
 fn opencode_args(prompt: &PromptString, model: &ModelId) -> Vec<String> {
-    vec![
-        "run".to_owned(),
-        "--format".to_owned(),
-        "json".to_owned(),
-        "--model".to_owned(),
-        model.0.clone(),
-        prompt.0.clone(),
-    ]
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone)]
 pub struct LifecycleStep {
     pub name: StepName,
     pub effect: Effect,
 }
