--- src/lifecycle/types/ids.rs
+++ replace || with && in is_bead_char
@@ -33,17 +33,17 @@
 
 impl std::fmt::Display for BeadId {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         write!(f, "{}", self.0)
     }
 }
 
 fn is_bead_char(c: char) -> bool {
-    c.is_ascii_lowercase() || c.is_ascii_digit() || c == '-'
+    c.is_ascii_lowercase() && /* ~ changed by cargo-mutants ~ */ c.is_ascii_digit() || c == '-'
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum BeadIdParseError {
     Empty,
     TooLong { len: usize, max: usize },
     InvalidChars,
 }
