--- src/lifecycle/types/newtypes.rs
+++ replace <impl std::fmt::Debug for SensitiveString>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -50,17 +50,17 @@
 #[derive(Debug, Clone, PartialEq, Eq, Serialize, Deserialize)]
 pub struct JjArgs(pub Vec<String>);
 
 #[derive(Clone, PartialEq, Eq, Serialize, Deserialize)]
 pub struct SensitiveString(pub String);
 
 impl std::fmt::Debug for SensitiveString {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        write!(f, "SensitiveString(***)")
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl SensitiveString {
     #[must_use]
     pub fn as_str(&self) -> &str {
         &self.0
     }
