--- src/lifecycle/types/state_machine.rs
+++ replace executing_workspace_ready -> Option<Phase> with Some(Default::default())
@@ -98,22 +98,17 @@
             bead: bead.clone(),
             step: step.clone(),
         }),
         _ => None,
     }
 }
 
 fn executing_workspace_ready(phase: &Phase, event: &StateEvent) -> Option<Phase> {
-    match (phase, event) {
-        (Phase::Executing { bead, .. }, StateEvent::WorkspaceReady) => {
-            Some(Phase::WorkspaceReady { bead: bead.clone() })
-        }
-        _ => None,
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn completed_transition(phase: &Phase, event: &StateEvent) -> Option<Phase> {
     match (phase, event) {
         (
             Phase::WorkspaceReady { bead } | Phase::Executing { bead, .. },
             StateEvent::Completed(result),
         ) => Some(Phase::Completed {
