--- src/lifecycle/types/state_machine.rs
+++ delete match arm (Phase::Executing{bead, ..}, StateEvent::WorkspaceReady) in executing_workspace_ready
@@ -99,19 +99,17 @@
             step: step.clone(),
         }),
         _ => None,
     }
 }
 
 fn executing_workspace_ready(phase: &Phase, event: &StateEvent) -> Option<Phase> {
     match (phase, event) {
-        (Phase::Executing { bead, .. }, StateEvent::WorkspaceReady) => {
-            Some(Phase::WorkspaceReady { bead: bead.clone() })
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 fn completed_transition(phase: &Phase, event: &StateEvent) -> Option<Phase> {
     match (phase, event) {
         (
             Phase::WorkspaceReady { bead } | Phase::Executing { bead, .. },
