--- src/lifecycle/types/state_machine.rs
+++ replace completed_transition -> Option<Phase> with Some(Default::default())
@@ -107,26 +107,17 @@
         (Phase::Executing { bead, .. }, StateEvent::WorkspaceReady) => {
             Some(Phase::WorkspaceReady { bead: bead.clone() })
         }
         _ => None,
     }
 }
 
 fn completed_transition(phase: &Phase, event: &StateEvent) -> Option<Phase> {
-    match (phase, event) {
-        (
-            Phase::WorkspaceReady { bead } | Phase::Executing { bead, .. },
-            StateEvent::Completed(result),
-        ) => Some(Phase::Completed {
-            bead: bead.clone(),
-            result: *result,
-        }),
-        _ => None,
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn invalid_transition() -> LifecycleError {
     LifecycleError::terminal(FailureCategory::Validation, "invalid state transition")
 }
 
 fn failed_transition(phase: &Phase, error: &ErrorMessage) -> Result<Phase, LifecycleError> {
     match phase {
