--- src/lifecycle/types/state_machine.rs
+++ replace invalid_transition -> LifecycleError with Default::default()
@@ -120,17 +120,17 @@
             bead: bead.clone(),
             result: *result,
         }),
         _ => None,
     }
 }
 
 fn invalid_transition() -> LifecycleError {
-    LifecycleError::terminal(FailureCategory::Validation, "invalid state transition")
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn failed_transition(phase: &Phase, error: &ErrorMessage) -> Result<Phase, LifecycleError> {
     match phase {
         Phase::Planned { bead }
         | Phase::WorkspaceReady { bead }
         | Phase::Executing { bead, .. } => Ok(Phase::Failed {
             bead_id: bead.bead_id.clone(),
