--- src/lifecycle/types/state_machine.rs
+++ replace WorkflowState::with_advanced_step -> Self with Default::default()
@@ -158,16 +158,11 @@
         Ok(Self {
             phase: next_phase,
             completed_steps: self.completed_steps,
         })
     }
 
     #[must_use]
     pub fn with_advanced_step(self, step_name: StepName) -> Self {
-        let mut completed = self.completed_steps;
-        completed.push(step_name);
-        Self {
-            phase: self.phase,
-            completed_steps: completed,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
