--- src/lifecycle/types/state_machine.rs
+++ replace standard_transition -> Option<Phase> with None
@@ -67,20 +67,17 @@
 fn transition_phase(phase: &Phase, event: &StateEvent) -> Result<Phase, LifecycleError> {
     if let StateEvent::Failed(error) = event {
         return failed_transition(phase, error);
     }
     standard_transition(phase, event).ok_or_else(invalid_transition)
 }
 
 fn standard_transition(phase: &Phase, event: &StateEvent) -> Option<Phase> {
-    planned_workspace_ready(phase, event)
-        .or_else(|| step_started_transition(phase, event))
-        .or_else(|| executing_workspace_ready(phase, event))
-        .or_else(|| completed_transition(phase, event))
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn planned_workspace_ready(phase: &Phase, event: &StateEvent) -> Option<Phase> {
     match (phase, event) {
         (Phase::Planned { bead }, StateEvent::WorkspaceReady) => {
             Some(Phase::WorkspaceReady { bead: bead.clone() })
         }
         _ => None,
