--- src/lifecycle/types/state_machine.rs
+++ replace planned_workspace_ready -> Option<Phase> with None
@@ -74,22 +74,17 @@
 fn standard_transition(phase: &Phase, event: &StateEvent) -> Option<Phase> {
     planned_workspace_ready(phase, event)
         .or_else(|| step_started_transition(phase, event))
         .or_else(|| executing_workspace_ready(phase, event))
         .or_else(|| completed_transition(phase, event))
 }
 
 fn planned_workspace_ready(phase: &Phase, event: &StateEvent) -> Option<Phase> {
-    match (phase, event) {
-        (Phase::Planned { bead }, StateEvent::WorkspaceReady) => {
-            Some(Phase::WorkspaceReady { bead: bead.clone() })
-        }
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn step_started_transition(phase: &Phase, event: &StateEvent) -> Option<Phase> {
     match (phase, event) {
         (
             Phase::Planned { bead }
             | Phase::WorkspaceReady { bead }
             | Phase::Executing { bead, .. },
