--- src/lifecycle/types/state_machine.rs
+++ delete match arm (Phase::Planned{bead}, StateEvent::WorkspaceReady) in planned_workspace_ready
@@ -75,19 +75,17 @@
     planned_workspace_ready(phase, event)
         .or_else(|| step_started_transition(phase, event))
         .or_else(|| executing_workspace_ready(phase, event))
         .or_else(|| completed_transition(phase, event))
 }
 
 fn planned_workspace_ready(phase: &Phase, event: &StateEvent) -> Option<Phase> {
     match (phase, event) {
-        (Phase::Planned { bead }, StateEvent::WorkspaceReady) => {
-            Some(Phase::WorkspaceReady { bead: bead.clone() })
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 fn step_started_transition(phase: &Phase, event: &StateEvent) -> Option<Phase> {
     match (phase, event) {
         (
             Phase::Planned { bead }
