--- src/lifecycle/types/state_machine.rs
+++ replace step_started_transition -> Option<Phase> with Some(Default::default())
@@ -83,28 +83,17 @@
         (Phase::Planned { bead }, StateEvent::WorkspaceReady) => {
             Some(Phase::WorkspaceReady { bead: bead.clone() })
         }
         _ => None,
     }
 }
 
 fn step_started_transition(phase: &Phase, event: &StateEvent) -> Option<Phase> {
-    match (phase, event) {
-        (
-            Phase::Planned { bead }
-            | Phase::WorkspaceReady { bead }
-            | Phase::Executing { bead, .. },
-            StateEvent::StepStarted(step),
-        ) => Some(Phase::Executing {
-            bead: bead.clone(),
-            step: step.clone(),
-        }),
-        _ => None,
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn executing_workspace_ready(phase: &Phase, event: &StateEvent) -> Option<Phase> {
     match (phase, event) {
         (Phase::Executing { bead, .. }, StateEvent::WorkspaceReady) => {
             Some(Phase::WorkspaceReady { bead: bead.clone() })
         }
         _ => None,
