--- src/lifecycle/types/state_machine.rs
+++ delete match arm (Phase::Planned{bead} | Phase::WorkspaceReady{bead} | Phase::Executing{bead, ..}, StateEvent::StepStarted(step),) in step_started_transition
@@ -84,25 +84,17 @@
             Some(Phase::WorkspaceReady { bead: bead.clone() })
         }
         _ => None,
     }
 }
 
 fn step_started_transition(phase: &Phase, event: &StateEvent) -> Option<Phase> {
     match (phase, event) {
-        (
-            Phase::Planned { bead }
-            | Phase::WorkspaceReady { bead }
-            | Phase::Executing { bead, .. },
-            StateEvent::StepStarted(step),
-        ) => Some(Phase::Executing {
-            bead: bead.clone(),
-            step: step.clone(),
-        }),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 fn executing_workspace_ready(phase: &Phase, event: &StateEvent) -> Option<Phase> {
     match (phase, event) {
         (Phase::Executing { bead, .. }, StateEvent::WorkspaceReady) => {
             Some(Phase::WorkspaceReady { bead: bead.clone() })
