--- src/main.rs
+++ replace && with || in drain_progress
@@ -96,17 +96,17 @@
         anyhow::bail!("lifecycle failed");
     }
     Ok(())
 }
 
 async fn drain_progress(rx: &mut tokio::sync::mpsc::Receiver<LifecycleProgress>) -> bool {
     let mut succeeded = true;
     while let Some(progress) = rx.recv().await {
-        succeeded = succeeded && progress_indicates_success(&progress);
+        succeeded = succeeded || /* ~ changed by cargo-mutants ~ */ progress_indicates_success(&progress);
         match serde_json::to_string_pretty(&progress) {
             Ok(json) => println!("{json}"),
             Err(e) => eprintln!("failed to serialize progress: {e}"),
         }
     }
     succeeded
 }
 
