--- src/main.rs
+++ replace progress_indicates_success -> bool with true
@@ -106,21 +106,17 @@
             Ok(json) => println!("{json}"),
             Err(e) => eprintln!("failed to serialize progress: {e}"),
         }
     }
     succeeded
 }
 
 fn progress_indicates_success(progress: &LifecycleProgress) -> bool {
-    match progress {
-        LifecycleProgress::StepFailed { .. } => false,
-        LifecycleProgress::Finished { result, .. } => result.is_success(),
-        _ => true,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 // ─── TESTS ───────────────────────────────────────────────────────────────────
 
 #[allow(clippy::unwrap_used, clippy::expect_used, clippy::panic)]
 #[cfg(test)]
 mod tests {
     use super::*;
