--- src/main.rs
+++ delete match arm LifecycleProgress::StepFailed{..} in progress_indicates_success
@@ -107,17 +107,17 @@
             Err(e) => eprintln!("failed to serialize progress: {e}"),
         }
     }
     succeeded
 }
 
 fn progress_indicates_success(progress: &LifecycleProgress) -> bool {
     match progress {
-        LifecycleProgress::StepFailed { .. } => false,
+         /* ~ changed by cargo-mutants ~ */
         LifecycleProgress::Finished { result, .. } => result.is_success(),
         _ => true,
     }
 }
 
 // ─── TESTS ───────────────────────────────────────────────────────────────────
 
 #[allow(clippy::unwrap_used, clippy::expect_used, clippy::panic)]
