--- src/main.rs
+++ delete match arm LifecycleProgress::Finished{result, ..} in progress_indicates_success
@@ -108,17 +108,17 @@
         }
     }
     succeeded
 }
 
 fn progress_indicates_success(progress: &LifecycleProgress) -> bool {
     match progress {
         LifecycleProgress::StepFailed { .. } => false,
-        LifecycleProgress::Finished { result, .. } => result.is_success(),
+         /* ~ changed by cargo-mutants ~ */
         _ => true,
     }
 }
 
 // ─── TESTS ───────────────────────────────────────────────────────────────────
 
 #[allow(clippy::unwrap_used, clippy::expect_used, clippy::panic)]
 #[cfg(test)]
