--- src/main.rs
+++ replace main -> anyhow::Result<()> with Ok(())
@@ -36,22 +36,17 @@
     #[arg(long, default_value = "opencode")]
     server_user: String,
     #[arg(long, env = "OPENCODE_SERVER_PASSWORD")]
     server_password: Option<String>,
 }
 
 #[tokio::main]
 async fn main() -> anyhow::Result<()> {
-    fmt().with_env_filter(EnvFilter::from_default_env()).init();
-
-    let args = Args::parse();
-    let orchestrator = LifecycleOrchestrator::new(build_config(&args)?)
-        .map_err(|e| anyhow::anyhow!("failed to create lifecycle orchestrator: {}", e))?;
-    run_request(&orchestrator, args).await
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn build_config(args: &Args) -> anyhow::Result<LifecycleConfig> {
     Ok(LifecycleConfig {
         data_dir: crate::lifecycle::types::DataDirPath(
             args.data_dir.to_string_lossy().into_owned(),
         ),
         opencode_server: build_server_config(args)?,
