--- src/main.rs
+++ replace build_server_config -> anyhow::Result<Option<OpencodeServerConfig>> with Ok(None)
@@ -54,30 +54,17 @@
         data_dir: crate::lifecycle::types::DataDirPath(
             args.data_dir.to_string_lossy().into_owned(),
         ),
         opencode_server: build_server_config(args)?,
     })
 }
 
 fn build_server_config(args: &Args) -> anyhow::Result<Option<OpencodeServerConfig>> {
-    let opencode_server = match (&args.server, &args.server_password) {
-        (Some(url), Some(password)) => Some(OpencodeServerConfig {
-            url: OpencodeUrl(url.clone()),
-            username: Username(args.server_user.clone()),
-            password: SensitiveString(password.clone()),
-        }),
-        (Some(_), None) => {
-            anyhow::bail!(
-                "--server-password (or OPENCODE_SERVER_PASSWORD) required when using --server"
-            )
-        }
-        _ => None,
-    };
-    Ok(opencode_server)
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn build_request(args: Args) -> anyhow::Result<LifecycleRequest> {
     let Some(bead_id_str) = args.bead_id else {
         anyhow::bail!("No bead_id specified. Use --bead-id to specify a bead.");
     };
     let bead_id =
         BeadId::parse(&bead_id_str).map_err(|e| anyhow::anyhow!("invalid bead id: {}", e))?;
