--- src/main.rs
+++ delete match arm (Some(_), None) in build_server_config
@@ -60,21 +60,17 @@
 
 fn build_server_config(args: &Args) -> anyhow::Result<Option<OpencodeServerConfig>> {
     let opencode_server = match (&args.server, &args.server_password) {
         (Some(url), Some(password)) => Some(OpencodeServerConfig {
             url: OpencodeUrl(url.clone()),
             username: Username(args.server_user.clone()),
             password: SensitiveString(password.clone()),
         }),
-        (Some(_), None) => {
-            anyhow::bail!(
-                "--server-password (or OPENCODE_SERVER_PASSWORD) required when using --server"
-            )
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     };
     Ok(opencode_server)
 }
 
 fn build_request(args: Args) -> anyhow::Result<LifecycleRequest> {
     let Some(bead_id_str) = args.bead_id else {
         anyhow::bail!("No bead_id specified. Use --bead-id to specify a bead.");
