--- src/main.rs
+++ replace build_request -> anyhow::Result<LifecycleRequest> with Ok(Default::default())
@@ -71,27 +71,17 @@
             )
         }
         _ => None,
     };
     Ok(opencode_server)
 }
 
 fn build_request(args: Args) -> anyhow::Result<LifecycleRequest> {
-    let Some(bead_id_str) = args.bead_id else {
-        anyhow::bail!("No bead_id specified. Use --bead-id to specify a bead.");
-    };
-    let bead_id =
-        BeadId::parse(&bead_id_str).map_err(|e| anyhow::anyhow!("invalid bead id: {}", e))?;
-    Ok(LifecycleRequest {
-        bead_id,
-        model: args.model.map(ModelId),
-        repo: args.repo.map(RepoUrl),
-        prompt: args.prompt.map(PromptString),
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn run_request(orchestrator: &LifecycleOrchestrator, args: Args) -> anyhow::Result<()> {
     let request = build_request(args)?;
     let mut progress_rx = orchestrator.run_lifecycle(request).await?;
     if !drain_progress(&mut progress_rx).await {
         anyhow::bail!("lifecycle failed");
     }
