--- src/main.rs
+++ replace build_config -> anyhow::Result<LifecycleConfig> with Ok(Default::default())
@@ -45,22 +45,17 @@
 
     let args = Args::parse();
     let orchestrator = LifecycleOrchestrator::new(build_config(&args)?)
         .map_err(|e| anyhow::anyhow!("failed to create lifecycle orchestrator: {}", e))?;
     run_request(&orchestrator, args).await
 }
 
 fn build_config(args: &Args) -> anyhow::Result<LifecycleConfig> {
-    Ok(LifecycleConfig {
-        data_dir: crate::lifecycle::types::DataDirPath(
-            args.data_dir.to_string_lossy().into_owned(),
-        ),
-        opencode_server: build_server_config(args)?,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn build_server_config(args: &Args) -> anyhow::Result<Option<OpencodeServerConfig>> {
     let opencode_server = match (&args.server, &args.server_password) {
         (Some(url), Some(password)) => Some(OpencodeServerConfig {
             url: OpencodeUrl(url.clone()),
             username: Username(args.server_user.clone()),
             password: SensitiveString(password.clone()),
